-- To fill database
-- launch:
-- psql -h macppc minibuses oleg -f dataDrivers.sql
--
insert into buses.drivers
(
    last_name,
    first_name,
    middle_name,
    date_birth,
    drive_license,
    drive_license_valid,
    home_address,
    telephone,
    status
) values
(
    'Иванов'
    ,'Илья'
    ,'Петрович'
    ,'1999-08-24'
    ,'98 04 613942 ГИБДД 7812'
    ,'2024-12-31'
    ,'Санкт-Петербург, улица Вавилова, дом 35, кв.72'
    ,'+7(812)332-11-67'
    ,'ADDED'
),
(
    'Ермаков'
    ,'Владимир'
    ,'Евгеньевич'
    ,'1982-02-15'
    ,'99 14 561342 ГИБДД 7814'
    ,'2028-01-15'
    ,'Санкт-Петербург, улица Лесная, дом 4, кв.172'
    ,'+7(931)116-45-82'
    ,'ADDED'
),
(
    'Петров'
    ,'Иван'
    ,'Львович'
    ,'1989-11-24'
    ,'92 04 125942 ГИБДД 7812'
    ,'2026-12-31'
    ,'Санкт-Петербург, улица Щепкина, дом 135, кв.2'
    ,'+7(901)311-06-27'
    ,'ADDED'
),
(
    'Зайцев'
    ,'Олег'
    ,'Петрович'
    ,'1991-03-24'
    ,'98 44 690142 ГИБДД 7812'
    ,'2026-04-30'
    ,'Санкт-Петербург, улица Ушинского, дом 35, кв.112'
    ,'+7(812)671-03-57'
    ,'ADDED'
),
(
    'Волков'
    ,'Александр'
    ,'Викторович'
    ,'2000-05-12'
    ,'98 04 678142 ГИБДД 7812'
    ,'2027-09-30'
    ,'Санкт-Петербург, улица Яблочкова, дом 125, кв.7'
    ,'+7(812)532-15-88'
    ,'ADDED'
),
(
    'Сидоров'
    ,'Петр'
    ,'Иванович'
    ,'1990-01-02'
    ,'78 01 602542 ГИБДД 7812'
    ,'2025-10-30'
    ,'Санкт-Петербург, улица Вишневского, дом 3, кв.7'
    ,'+7(812)211-45-97'
    ,'ADDED'
);
